# Soccer Forecasting Project

## Setup

### Libraries

In [1]:
import pandas as pd

### Load Data

In [7]:
folder_path = '/Users/heshamnawaz/Desktop/Projects/soccer-forecasting-project'
elo_data = pd.read_csv(f"{folder_path}/data/EloRatings.csv")

In [8]:
elo_data

              date       club country      elo
0       2000-07-01     Aachen     GER  1453.60
1       2000-07-01    Aalborg     DEN  1482.61
2       2000-07-01      Aalst     BEL  1337.53
3       2000-07-01     Aarhus     DEN  1381.46
4       2000-07-01   Aberdeen     SCO  1360.43
...            ...        ...     ...      ...
242586  2025-03-01  Wolfsburg     GER  1681.99
242587  2025-03-01     Wolves     ENG  1677.75
242588  2025-03-01   Zaragoza     ESP  1482.18
242589  2025-03-01      Zenit     RUS  1634.92
242590  2025-03-01     Zwolle     NED  1455.01

[242591 rows x 4 columns]

## Work

In [16]:
# elo_data = 
(elo_data.assign(
    date = pd.to_datetime(elo_data.date),
    day = pd.to_datetime(elo_data.date).dt.day,
    month = pd.to_datetime(elo_data.date).dt.month,
    year = pd.to_datetime(elo_data.date).dt.year
).sort_values(by='date', ascending=True)
)

             date                club country      elo  day  month  year
0      2000-07-01              Aachen     GER  1453.60    1      7  2000
274    2000-07-01            Piacenza     ITA  1598.04    1      7  2000
273    2000-07-01   Petrolul Ploiesti     ROM  1330.04    1      7  2000
272    2000-07-01             Pescara     ITA  1563.65    1      7  2000
271    2000-07-01             Perugia     ITA  1658.87    1      7  2000
...           ...                 ...     ...      ...  ...    ...   ...
242314 2025-03-01            Freiburg     GER  1680.06    1      3  2025
242313 2025-03-01         Fredrikstad     NOR  1375.72    1      3  2025
242312 2025-03-01  Fortuna Dusseldorf     GER  1533.97    1      3  2025
242322 2025-03-01               Genoa     ITA  1668.43    1      3  2025
242590 2025-03-01              Zwolle     NED  1455.01    1      3  2025

[242591 rows x 7 columns]

In [14]:
elo_data[elo_data.country == 'ENG']

              date         club country      elo
26      2000-07-01      Arsenal     ENG  1871.66
27      2000-07-01  Aston Villa     ENG  1728.15
40      2000-07-01     Barnsley     ENG  1562.94
51      2000-07-01   Birmingham     ENG  1560.75
53      2000-07-01    Blackburn     ENG  1527.02
...            ...          ...     ...      ...
242549  2025-03-01    Tottenham     ENG  1790.23
242576  2025-03-01      Watford     ENG  1481.42
242579  2025-03-01    West Brom     ENG  1534.99
242580  2025-03-01     West Ham     ENG  1731.25
242587  2025-03-01       Wolves     ENG  1677.75

[26146 rows x 4 columns]

In [ ]:
Our rows are going to be the matches. For each match, we have the following information:
# - Date of the match
# - Home Team
# - Away Team
# - Home Team Goals
# - Away Team Goals
# - Home Team Elo Rating on the most recent date before the match
# - Away Team Elo Rating on the most recent date before the match

# For each ma